app/views/visitors/index.html.erb

where their colleagues are sitting.</p>
<p><%= link_to 'Staffs:', users_path %> <%= User.count %>  booked seat(s)</p>
---
SELECT COUNT(*) FROM "users"