app/controllers/seats_controller.rb

SELECT "seats".* FROM "seats"
---
  def index
    @seats = Seat.all

INSERT INTO "seats" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "A1"], ["created_at", "2019-06-26 05:19:34.871541"], ["updated_at", "2019-06-26 05:19:34.871541"]]
---
  def create
    @seat = Seat.new(seat_params)

    respond_to do |format|
      if @seat.save

SELECT  "seats".* FROM "seats" WHERE "seats"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_seat
      @seat = Seat.find(params[:id])