app/controllers/users_controller.rb

  def book_seat
    @user = current_user
    @seats = Seat.all
---
SELECT "seats".* FROM "seats"

  def assign_seat
    @seats = Seat.all
    @user = current_user
    respond_to do |format|
      if @user.update(seat_id: params[:seat_id], seat_from_date: params[:seat_from_date], seat_end_date: params[:seat_end_date] )
---
SELECT "seats".* FROM "seats"
UPDATE "users" SET "seat_id" = ?, "seat_from_date" = ?, "seat_end_date" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["seat_id", 1], ["seat_from_date", "2019-11-06"], ["seat_end_date", "2019-12-06"], ["updated_at", "2019-06-26 07:11:24.211471"], ["id", 1]]